app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "TestMailer"], ["email", "testmailer@test.ru"], ["created_at", "2022-02-07 14:18:42.146873"], ["updated_at", "2022-02-07 14:18:42.146873"]]
---
    def create
        @user = User.create(user_data)

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "vadisychev@my.com"], ["updated_at", "2022-02-07 14:31:39.500412"], ["id", 17]]
---
    def update
        @user.update(user_data)

SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "testmailer@test.ru"], ["LIMIT", 1]]
---
        def is_registered
            puts "================================"
            p params[:email]
            p params[:user]
            userparams = params[:user]
            p userparams[:email]
            puts "================================"
            if User.exists?(email: userparams[:email])